Repository: 0xEDU/ft_transcendence
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr, pt_br

source: English
fr: Anglais
pt_br: Inglês

source: French
fr: Français
pt_br: Francês

source: Brazilian Portuguese
fr: Portugais brésilien
pt_br: Português brasileiro

source: Accept
fr: Accepter
pt_br: Aceitar

source: View Profile
fr: Voir le profil
pt_br: Ver Perfil

source: (Pending friendship request)
fr: (Demande d'amitié en attente)
pt_br: (Pedido de Amizade Pendente)

source: friends
fr: ami(e)s
pt_br: companheiros

source: time played
fr: temps joué
pt_br: tempo jogado

source: classic matches
fr: matchs classiques
pt_br: partidas clássicas

source: co-op matches
fr: matchs coopératifs
pt_br: jogos cooperativos jogados

source: wins
fr: victoires
pt_br: vitórias

source: achievement
fr: succès

source: Invalid game mode: '%(match_type)s'
fr: Mode de jeu invalide: '%(match_type)s'
pt_br: Modo inválido: '%(match_type)s'

source: Fill in the names of all players to start the match.
fr: Remplissez les noms de tous les joueurs pour commencer le match.
pt_br: Insira todos os nomes para iniciar a partida.

source: You can't match a player against themselves!
fr: Il ne faut pas insérer le même nom deux fois
pt_br: Uma pessoa não pode jogar consigo mesma!

source: User '%(player)s' does not exist
fr: L'utilisateur '%(player)s' n'existe pas
pt_br: O login '%(player)s' não está cadastrado

source: Missing required parameter: '%(param)s'
fr: Paramètre requis manquant: '%(param)s'
pt_br: Parâmetro faltando: '%(param)s'

source: 🤝 joined forces with %(player2_name)s
fr: 🤝 a rejoint les forces avec %(player2_name)s
pt_br: 🤝 juntou forças com %(player2_name)s

source: 🥇 won against %(player2_name)s
fr: 🥇 a gagné contre %(player2_name)s
pt_br: 🥇 venceu contra %(player2_name)s

source: 🥈 lost to %(player2_name)s
fr: 🥈 à perdu contre %(player2_name)s
pt_br: 🥈 perdeu para %(player2_name)s

source: Enter your new display name
fr: Entrez votre nouveau nom d'affichage
pt_br: Insira seu novo nick

source: Select a file to upload
fr: Sélectionnez un fichier à téléverser
pt_br: Escolha um arquivo pra subir

source: %(user_display_name)s's friends
fr: Ami(e)s de %(user_display_name)s
pt_br: Amigos de %(user_display_name)s

source: Search for someone
fr: Rechercher quelqu'un
pt_br: Procurar por alguém

source: Add Friend
fr: Ajouter un ami(e)
pt_br: Adicionar Amigo

source: "Do you want to add "<span id="modalUserNameAdd"></span>" as a friend?"
fr: "Veux-tu ajouter "<span id="modalUserNameAdd"></span>" en tant qu'ami(e)?"
pt_br: "Você quer adicionar "<span id="modalUserNameAdd"></span>" como um amigo?"

source: Add as Friend
fr: Accepter
pt_br: Adicionar Amigo

source: Pending Friend
fr: Ami(e) en attente
pt_br: Pedido de Amizade Pendente

source: "Do you want to remove "<span id="modalUserNamePending"></span>"'s friendship request ?"
fr: "Veux-tu supprimer la demande d'amitié de "<span id="modalUserNamePending"></span>" ?"
pt_br: "Você quer remover o pedido de amizade para "<span id="modalUserNamePending"></span>" ?"

source: Remove Request
fr: Supprimer
pt_br: Remover Pedido de Amizade

source: Remove Friend
fr: Supprimer ami(e)
pt_br: Remover Amigo

source: "Do you want to remove " <span id="modalUserNameRemove"></span>"'s friendship?"
fr: "Veux-tu supprimer l'amitié de " <span id="modalUserNameRemove"></span>"?"
pt_br: "Você quer remover " <span id="modalUserNameRemove"></span>" dos seus amigos?"

source: Team ball hits record
fr: Coups de balle
pt_br: Recorde de batidas

source: Distance traveled with a companion
fr: Distance parcourue ensemble
pt_br: Distância viajada em companhia

source: Total hours played
fr: Heures de jeu totales
pt_br: Total de horas de jogo

source: Companions encountered
fr: Compagnons rencontrés
pt_br: Encontros

source: Classic games won
fr: Jeux classiques gagnés
pt_br: Jogos clássicos ganhos

source: Classic games lost
fr: Jeux classiques perdus
pt_br: Jogos clássicos perdidos

source: MADE WITH { <span class="emoji">❤️</span> }
fr: FABRIQUÉE AVEC { <span class="emoji">❤️</span> }
pt_br: FEITO COM { <span class="emoji">❤️</span> }

source: BY { <span class="name">roaraujo</span> <img src="%(static 'images/roaraujo.jpeg')s" alt="roaraujo's picture"> }
fr: PAR { <span class="name">roaraujo</span> <img src="%(static 'images/roaraujo.jpeg')s" alt="roaraujo's picture"> }
pt_br: POR { <span class="name">roaraujo</span> <img src="%(static 'images/roaraujo.jpeg')s" alt="roaraujo's picture"> }

source: SINGLE MATCH
fr: MATCH UNIQUE
pt_br: PARTIDA

source: TOURNAMENT
fr: TOURNOI
pt_br: TORNEIO

source: GAME MODE
fr: MODE DE JEU
pt_br: MODO

source: CO-OP
fr: COOPERATIF
pt_br: COOPERATIVO

source: CLASSIC
fr: CLASSIQUE
pt_br: CLÁSSICO

source: PLAYER
fr: JOUEUR/JOUEUSE
pt_br: JOGADOR

source: TWO
fr: DEUX
pt_br: DOIS

source: FOUR
fr: QUATRE
pt_br: QUATRO

source: MAP
fr: CARTE
pt_br: MAPA

source: MAP 1
fr: CARTE 1
pt_br: MAPA 1

source: MAP 2
fr: CARTE 2
pt_br: MAPA 2

source: EIGHT
fr: HUIT
pt_br: OITO

source: ACHIEVEMENTS
fr: SUCCÈS
pt_br: CONQUISTAS

source: MATES ALONG THE WAY
fr: AMI(E)S RENCONTRÉ(E)S
pt_br: AMIZADES DO CAMINHO

source: Upload Picture
fr: Téléverser Photo
pt_br: Carregar foto

source: CHANGE PROFILE PICTURE
fr: CHANGER LA PDP
pt_br: MUDAR FOTO DE PERFIL

source: MATCHES HISTORY
fr: MATCHS
pt_br: PARTIDAS

source: TOURNAMENTS
fr: TOURNOIS
pt_br: TORNEIOS

source: USER STATS
fr: MES STATS
pt_br: MEUS STATS

source: No matches played yet
fr: Aucun match joué pour l'instant
pt_br: Você ainda não jogou nenhuma partida

source: You haven't played any tournaments yet.
fr: Vous n'avez joué aucun tournoi pour l'instant
pt_br: Você ainda não participou de nenhum torneio

source: Distance icon
fr: Icône de distance
pt_br: Ícone de distância

source: Distance walked together
fr: Distance parcourue ensemble
pt_br: Distância percorrida em companhia

source: DISTANCE WALKED TOGETHER
fr: DISTANCE PARCOURUE ENSEMBLE
pt_br: DISTÂNCIA EM COMPANHIA

source: HIGH FIVE COUNT
fr: NOMBRE DE HIGH FIVES
pt_br: CONTAGEM DE ENCONTROS

source: You played %(bff_matches)s matches with %(bff_login)s!
fr: Vouz avez joué %(bff_matches)s matchs avec %(bff_login)s!
pt_br: Você jogou %(bff_matches)s partidas com %(bff_login)s!

source: You did not play with anyone yet!
fr: Vous n'avez joué avec personne pour l'instant
pt_br: Você ainda não jogou com ninguém!

source: TIME PLAYED
fr: HEURES DE JEU
pt_br: TEMPO DE JOGO

source: PLAYERS MET
fr: JOUEUR(E)S RENCONTRÉ(E)S
pt_br: ENCONTROS

source: distance traveled
pt_br: distância viajada
